# StructuralSectionConcreteRectangle Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionConcreteRectangle Class
Members See Also
---
Defines parameters for parameterized concrete rectangle structural section.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class StructuralSectionConcreteRectangle : StructuralSectionRectangular
```

Visual Basic
---
```text
Public Class StructuralSectionConcreteRectangle _
	Inherits StructuralSectionRectangular
```

Visual C++
---
```text
public ref class StructuralSectionConcreteRectangle : public StructuralSectionRectangular
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionConcreteRectangle
# See Also
StructuralSectionConcreteRectangle Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace